Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/rtc.h
/* -------- RTC_LSTR : (RTC Offset: 0x08) ( R/ 32) Last Stamping Time Register of Source 0 -------- */
#define RTC_LSTR_SEC_Pos                      _UINT32_(0)                                          /* (RTC_LSTR) Seconds of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_LSTR_SEC_Msk                      (_UINT32_(0x7F) << RTC_LSTR_SEC_Pos)                 /* (RTC_LSTR) Seconds of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_LSTR_SEC(value)                   (RTC_LSTR_SEC_Msk & (_UINT32_(value) << RTC_LSTR_SEC_Pos)) /* Assigment of value for SEC in the RTC_LSTR register */
#define RTC_LSTR_MIN_Pos                      _UINT32_(8)                                          /* (RTC_LSTR) Minutes of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_LSTR_MIN_Msk                      (_UINT32_(0x7F) << RTC_LSTR_MIN_Pos)                 /* (RTC_LSTR) Minutes of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_LSTR_MIN(value)                   (RTC_LSTR_MIN_Msk & (_UINT32_(value) << RTC_LSTR_MIN_Pos)) /* Assigment of value for MIN in the RTC_LSTR register */
#define RTC_LSTR_HOUR_Pos                     _UINT32_(16)                                         /* (RTC_LSTR) Hours of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_LSTR_HOUR_Msk                     (_UINT32_(0x3F) << RTC_LSTR_HOUR_Pos)                /* (RTC_LSTR) Hours of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_LSTR_HOUR(value)                  (RTC_LSTR_HOUR_Msk & (_UINT32_(value) << RTC_LSTR_HOUR_Pos)) /* Assigment of value for HOUR in the RTC_LSTR register */
#define RTC_LSTR_AMPM_Pos                     _UINT32_(22)                                         /* (RTC_LSTR) AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_LSTR_AMPM_Msk                     (_UINT32_(0x1) << RTC_LSTR_AMPM_Pos)                 /* (RTC_LSTR) AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_LSTR_AMPM(value)                  (RTC_LSTR_AMPM_Msk & (_UINT32_(value) << RTC_LSTR_AMPM_Pos)) /* Assigment of value for AMPM in the RTC_LSTR register */
#define RTC_LSTR_BACKUP_Pos                   _UINT32_(31)                                         /* (RTC_LSTR) System Mode of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_LSTR_BACKUP_Msk                   (_UINT32_(0x1) << RTC_LSTR_BACKUP_Pos)               /* (RTC_LSTR) System Mode of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_LSTR_BACKUP(value)                (RTC_LSTR_BACKUP_Msk & (_UINT32_(value) << RTC_LSTR_BACKUP_Pos)) /* Assigment of value for BACKUP in the RTC_LSTR register */
#define RTC_LSTR_Msk                          _UINT32_(0x807F7F7F)                                 /* (RTC_LSTR) Register Mask  */

/* UTC mode */
#define RTC_LSTR_UTC_Msk                      _UINT32_(0x00000000)                                  /* (RTC_LSTR_UTC) Register Mask  */


/* -------- RTC_LSDR : (RTC Offset: 0x0C) ( R/ 32) Last Stamping Date Register of Source 0 -------- */
#define RTC_LSDR_CENT_Pos                     _UINT32_(0)                                          /* (RTC_LSDR) Century of the Tamper (cleared on read) Position */
#define RTC_LSDR_CENT_Msk                     (_UINT32_(0x7F) << RTC_LSDR_CENT_Pos)                /* (RTC_LSDR) Century of the Tamper (cleared on read) Mask */
#define RTC_LSDR_CENT(value)                  (RTC_LSDR_CENT_Msk & (_UINT32_(value) << RTC_LSDR_CENT_Pos)) /* Assigment of value for CENT in the RTC_LSDR register */
#define RTC_LSDR_YEAR_Pos                     _UINT32_(8)                                          /* (RTC_LSDR) Year of the Tamper (cleared on read) Position */
#define RTC_LSDR_YEAR_Msk                     (_UINT32_(0x7F) << RTC_LSDR_YEAR_Pos)                /* (RTC_LSDR) Year of the Tamper (cleared on read) Mask */
#define RTC_LSDR_YEAR(value)                  (RTC_LSDR_YEAR_Msk & (_UINT32_(value) << RTC_LSDR_YEAR_Pos)) /* Assigment of value for YEAR in the RTC_LSDR register */
#define RTC_LSDR_MONTH_Pos                    _UINT32_(16)                                         /* (RTC_LSDR) Month of the Tamper (cleared on read) Position */
#define RTC_LSDR_MONTH_Msk                    (_UINT32_(0x1F) << RTC_LSDR_MONTH_Pos)               /* (RTC_LSDR) Month of the Tamper (cleared on read) Mask */
#define RTC_LSDR_MONTH(value)                 (RTC_LSDR_MONTH_Msk & (_UINT32_(value) << RTC_LSDR_MONTH_Pos)) /* Assigment of value for MONTH in the RTC_LSDR register */
#define RTC_LSDR_DAY_Pos                      _UINT32_(21)                                         /* (RTC_LSDR) Day of the Tamper (cleared on read) Position */
#define RTC_LSDR_DAY_Msk                      (_UINT32_(0x7) << RTC_LSDR_DAY_Pos)                  /* (RTC_LSDR) Day of the Tamper (cleared on read) Mask */
#define RTC_LSDR_DAY(value)                   (RTC_LSDR_DAY_Msk & (_UINT32_(value) << RTC_LSDR_DAY_Pos)) /* Assigment of value for DAY in the RTC_LSDR register */
#define RTC_LSDR_DATE_Pos                     _UINT32_(24)                                         /* (RTC_LSDR) Date of the Tamper (cleared on read) Position */
#define RTC_LSDR_DATE_Msk                     (_UINT32_(0x3F) << RTC_LSDR_DATE_Pos)                /* (RTC_LSDR) Date of the Tamper (cleared on read) Mask */
#define RTC_LSDR_DATE(value)                  (RTC_LSDR_DATE_Msk & (_UINT32_(value) << RTC_LSDR_DATE_Pos)) /* Assigment of value for DATE in the RTC_LSDR register */
#define RTC_LSDR_Msk                          _UINT32_(0x3FFF7F7F)                                 /* (RTC_LSDR) Register Mask  */

/* UTC mode */
#define RTC_LSDR_UTC_Msk                      _UINT32_(0x00000000)                                  /* (RTC_LSDR_UTC) Register Mask  */


/* -------- RTC_CR : (RTC Offset: 0x00) (R/W 32) Control Register -------- */
#define RTC_CR_UPDTIM_Pos                     _UINT32_(0)                                          /* (RTC_CR) Update Request Time Register Position */
#define RTC_CR_UPDTIM_Msk                     (_UINT32_(0x1) << RTC_CR_UPDTIM_Pos)                 /* (RTC_CR) Update Request Time Register Mask */
#define RTC_CR_UPDTIM(value)                  (RTC_CR_UPDTIM_Msk & (_UINT32_(value) << RTC_CR_UPDTIM_Pos)) /* Assigment of value for UPDTIM in the RTC_CR register */
#define   RTC_CR_UPDTIM_STOP_UPDATE_Val       _UINT32_(0x0)                                        /* (RTC_CR) No effect or, if UPDTIM has been previously written to 1, stops the update procedure.  */
#define   RTC_CR_UPDTIM_START_UPDATE_Val      _UINT32_(0x1)                                        /* (RTC_CR) Stops the RTC time counting. Second, minute and hour counters can be programmed once this bit is set and acknowledged by the bit ACKUPD of the RTC_SR.  */
#define RTC_CR_UPDTIM_STOP_UPDATE             (RTC_CR_UPDTIM_STOP_UPDATE_Val << RTC_CR_UPDTIM_Pos) /* (RTC_CR) No effect or, if UPDTIM has been previously written to 1, stops the update procedure. Position  */
#define RTC_CR_UPDTIM_START_UPDATE            (RTC_CR_UPDTIM_START_UPDATE_Val << RTC_CR_UPDTIM_Pos) /* (RTC_CR) Stops the RTC time counting. Second, minute and hour counters can be programmed once this bit is set and acknowledged by the bit ACKUPD of the RTC_SR. Position  */
#define RTC_CR_UPDCAL_Pos                     _UINT32_(1)                                          /* (RTC_CR) Update Request Calendar Register Position */
#define RTC_CR_UPDCAL_Msk                     (_UINT32_(0x1) << RTC_CR_UPDCAL_Pos)                 /* (RTC_CR) Update Request Calendar Register Mask */
#define RTC_CR_UPDCAL(value)                  (RTC_CR_UPDCAL_Msk & (_UINT32_(value) << RTC_CR_UPDCAL_Pos)) /* Assigment of value for UPDCAL in the RTC_CR register */
#define   RTC_CR_UPDCAL_STOP_UPDATE_Val       _UINT32_(0x0)                                        /* (RTC_CR) No effect or, if UPDCAL has been previously written to 1, stops the update procedure.  */
#define   RTC_CR_UPDCAL_START_UPDATE_Val      _UINT32_(0x1)                                        /* (RTC_CR) Stops the RTC calendar counting.  */
#define RTC_CR_UPDCAL_STOP_UPDATE             (RTC_CR_UPDCAL_STOP_UPDATE_Val << RTC_CR_UPDCAL_Pos) /* (RTC_CR) No effect or, if UPDCAL has been previously written to 1, stops the update procedure. Position  */
#define RTC_CR_UPDCAL_START_UPDATE            (RTC_CR_UPDCAL_START_UPDATE_Val << RTC_CR_UPDCAL_Pos) /* (RTC_CR) Stops the RTC calendar counting. Position  */
#define RTC_CR_TIMEVSEL_Pos                   _UINT32_(8)                                          /* (RTC_CR) Time Event Selection Position */
#define RTC_CR_TIMEVSEL_Msk                   (_UINT32_(0x3) << RTC_CR_TIMEVSEL_Pos)               /* (RTC_CR) Time Event Selection Mask */
#define RTC_CR_TIMEVSEL(value)                (RTC_CR_TIMEVSEL_Msk & (_UINT32_(value) << RTC_CR_TIMEVSEL_Pos)) /* Assigment of value for TIMEVSEL in the RTC_CR register */
#define   RTC_CR_TIMEVSEL_MINUTE_Val          _UINT32_(0x0)                                        /* (RTC_CR) Minute change  */
#define   RTC_CR_TIMEVSEL_HOUR_Val            _UINT32_(0x1)                                        /* (RTC_CR) Hour change  */
#define   RTC_CR_TIMEVSEL_MIDNIGHT_Val        _UINT32_(0x2)                                        /* (RTC_CR) Every day at midnight  */
#define   RTC_CR_TIMEVSEL_NOON_Val            _UINT32_(0x3)                                        /* (RTC_CR) Every day at noon  */
#define RTC_CR_TIMEVSEL_MINUTE                (RTC_CR_TIMEVSEL_MINUTE_Val << RTC_CR_TIMEVSEL_Pos)  /* (RTC_CR) Minute change Position  */
#define RTC_CR_TIMEVSEL_HOUR                  (RTC_CR_TIMEVSEL_HOUR_Val << RTC_CR_TIMEVSEL_Pos)    /* (RTC_CR) Hour change Position  */
#define RTC_CR_TIMEVSEL_MIDNIGHT              (RTC_CR_TIMEVSEL_MIDNIGHT_Val << RTC_CR_TIMEVSEL_Pos) /* (RTC_CR) Every day at midnight Position  */
#define RTC_CR_TIMEVSEL_NOON                  (RTC_CR_TIMEVSEL_NOON_Val << RTC_CR_TIMEVSEL_Pos)    /* (RTC_CR) Every day at noon Position  */
#define RTC_CR_CALEVSEL_Pos                   _UINT32_(16)                                         /* (RTC_CR) Calendar Event Selection Position */
#define RTC_CR_CALEVSEL_Msk                   (_UINT32_(0x3) << RTC_CR_CALEVSEL_Pos)               /* (RTC_CR) Calendar Event Selection Mask */
#define RTC_CR_CALEVSEL(value)                (RTC_CR_CALEVSEL_Msk & (_UINT32_(value) << RTC_CR_CALEVSEL_Pos)) /* Assigment of value for CALEVSEL in the RTC_CR register */
#define   RTC_CR_CALEVSEL_WEEK_Val            _UINT32_(0x0)                                        /* (RTC_CR) Week change (every Monday at time 00:00:00)  */
#define   RTC_CR_CALEVSEL_MONTH_Val           _UINT32_(0x1)                                        /* (RTC_CR) Month change (every 01 of each month at time 00:00:00)  */
#define   RTC_CR_CALEVSEL_YEAR_Val            _UINT32_(0x2)                                        /* (RTC_CR) Year change (every January 1 at time 00:00:00)  */
#define RTC_CR_CALEVSEL_WEEK                  (RTC_CR_CALEVSEL_WEEK_Val << RTC_CR_CALEVSEL_Pos)    /* (RTC_CR) Week change (every Monday at time 00:00:00) Position  */
#define RTC_CR_CALEVSEL_MONTH                 (RTC_CR_CALEVSEL_MONTH_Val << RTC_CR_CALEVSEL_Pos)   /* (RTC_CR) Month change (every 01 of each month at time 00:00:00) Position  */
#define RTC_CR_CALEVSEL_YEAR                  (RTC_CR_CALEVSEL_YEAR_Val << RTC_CR_CALEVSEL_Pos)    /* (RTC_CR) Year change (every January 1 at time 00:00:00) Position  */
#define RTC_CR_Msk                            _UINT32_(0x00030303)                                 /* (RTC_CR) Register Mask  */


