Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/rtc.h
/* -------- RTC_IDR : (RTC Offset: 0x24) ( /W 32) Interrupt Disable Register -------- */
#define RTC_IDR_ACKDIS_Pos                    _UINT32_(0)                                          /* (RTC_IDR) Acknowledge Update Interrupt Disable Position */
#define RTC_IDR_ACKDIS_Msk                    (_UINT32_(0x1) << RTC_IDR_ACKDIS_Pos)                /* (RTC_IDR) Acknowledge Update Interrupt Disable Mask */
#define RTC_IDR_ACKDIS(value)                 (RTC_IDR_ACKDIS_Msk & (_UINT32_(value) << RTC_IDR_ACKDIS_Pos)) /* Assigment of value for ACKDIS in the RTC_IDR register */
#define RTC_IDR_ALRDIS_Pos                    _UINT32_(1)                                          /* (RTC_IDR) Alarm Interrupt Disable Position */
#define RTC_IDR_ALRDIS_Msk                    (_UINT32_(0x1) << RTC_IDR_ALRDIS_Pos)                /* (RTC_IDR) Alarm Interrupt Disable Mask */
#define RTC_IDR_ALRDIS(value)                 (RTC_IDR_ALRDIS_Msk & (_UINT32_(value) << RTC_IDR_ALRDIS_Pos)) /* Assigment of value for ALRDIS in the RTC_IDR register */
#define RTC_IDR_SECDIS_Pos                    _UINT32_(2)                                          /* (RTC_IDR) Second Event Interrupt Disable Position */
#define RTC_IDR_SECDIS_Msk                    (_UINT32_(0x1) << RTC_IDR_SECDIS_Pos)                /* (RTC_IDR) Second Event Interrupt Disable Mask */
#define RTC_IDR_SECDIS(value)                 (RTC_IDR_SECDIS_Msk & (_UINT32_(value) << RTC_IDR_SECDIS_Pos)) /* Assigment of value for SECDIS in the RTC_IDR register */
#define RTC_IDR_TIMDIS_Pos                    _UINT32_(3)                                          /* (RTC_IDR) Time Event Interrupt Disable Position */
#define RTC_IDR_TIMDIS_Msk                    (_UINT32_(0x1) << RTC_IDR_TIMDIS_Pos)                /* (RTC_IDR) Time Event Interrupt Disable Mask */
#define RTC_IDR_TIMDIS(value)                 (RTC_IDR_TIMDIS_Msk & (_UINT32_(value) << RTC_IDR_TIMDIS_Pos)) /* Assigment of value for TIMDIS in the RTC_IDR register */
#define RTC_IDR_CALDIS_Pos                    _UINT32_(4)                                          /* (RTC_IDR) Calendar Event Interrupt Disable Position */
#define RTC_IDR_CALDIS_Msk                    (_UINT32_(0x1) << RTC_IDR_CALDIS_Pos)                /* (RTC_IDR) Calendar Event Interrupt Disable Mask */
#define RTC_IDR_CALDIS(value)                 (RTC_IDR_CALDIS_Msk & (_UINT32_(value) << RTC_IDR_CALDIS_Pos)) /* Assigment of value for CALDIS in the RTC_IDR register */
#define RTC_IDR_TDERRDIS_Pos                  _UINT32_(5)                                          /* (RTC_IDR) Time and/or Date Error Interrupt Disable Position */
#define RTC_IDR_TDERRDIS_Msk                  (_UINT32_(0x1) << RTC_IDR_TDERRDIS_Pos)              /* (RTC_IDR) Time and/or Date Error Interrupt Disable Mask */
#define RTC_IDR_TDERRDIS(value)               (RTC_IDR_TDERRDIS_Msk & (_UINT32_(value) << RTC_IDR_TDERRDIS_Pos)) /* Assigment of value for TDERRDIS in the RTC_IDR register */
#define RTC_IDR_Msk                           _UINT32_(0x0000003F)                                 /* (RTC_IDR) Register Mask  */


/* -------- RTC_IMR : (RTC Offset: 0x28) ( R/ 32) Interrupt Mask Register -------- */
#define RTC_IMR_ACK_Pos                       _UINT32_(0)                                          /* (RTC_IMR) Acknowledge Update Interrupt Mask Position */
#define RTC_IMR_ACK_Msk                       (_UINT32_(0x1) << RTC_IMR_ACK_Pos)                   /* (RTC_IMR) Acknowledge Update Interrupt Mask Mask */
#define RTC_IMR_ACK(value)                    (RTC_IMR_ACK_Msk & (_UINT32_(value) << RTC_IMR_ACK_Pos)) /* Assigment of value for ACK in the RTC_IMR register */
#define RTC_IMR_ALR_Pos                       _UINT32_(1)                                          /* (RTC_IMR) Alarm Interrupt Mask Position */
#define RTC_IMR_ALR_Msk                       (_UINT32_(0x1) << RTC_IMR_ALR_Pos)                   /* (RTC_IMR) Alarm Interrupt Mask Mask */
#define RTC_IMR_ALR(value)                    (RTC_IMR_ALR_Msk & (_UINT32_(value) << RTC_IMR_ALR_Pos)) /* Assigment of value for ALR in the RTC_IMR register */
#define RTC_IMR_SEC_Pos                       _UINT32_(2)                                          /* (RTC_IMR) Second Event Interrupt Mask Position */
#define RTC_IMR_SEC_Msk                       (_UINT32_(0x1) << RTC_IMR_SEC_Pos)                   /* (RTC_IMR) Second Event Interrupt Mask Mask */
#define RTC_IMR_SEC(value)                    (RTC_IMR_SEC_Msk & (_UINT32_(value) << RTC_IMR_SEC_Pos)) /* Assigment of value for SEC in the RTC_IMR register */
#define RTC_IMR_TIM_Pos                       _UINT32_(3)                                          /* (RTC_IMR) Time Event Interrupt Mask Position */
#define RTC_IMR_TIM_Msk                       (_UINT32_(0x1) << RTC_IMR_TIM_Pos)                   /* (RTC_IMR) Time Event Interrupt Mask Mask */
#define RTC_IMR_TIM(value)                    (RTC_IMR_TIM_Msk & (_UINT32_(value) << RTC_IMR_TIM_Pos)) /* Assigment of value for TIM in the RTC_IMR register */
#define RTC_IMR_CAL_Pos                       _UINT32_(4)                                          /* (RTC_IMR) Calendar Event Interrupt Mask Position */
#define RTC_IMR_CAL_Msk                       (_UINT32_(0x1) << RTC_IMR_CAL_Pos)                   /* (RTC_IMR) Calendar Event Interrupt Mask Mask */
#define RTC_IMR_CAL(value)                    (RTC_IMR_CAL_Msk & (_UINT32_(value) << RTC_IMR_CAL_Pos)) /* Assigment of value for CAL in the RTC_IMR register */
#define RTC_IMR_TDERR_Pos                     _UINT32_(5)                                          /* (RTC_IMR) Time and/or Date Error Mask Position */
#define RTC_IMR_TDERR_Msk                     (_UINT32_(0x1) << RTC_IMR_TDERR_Pos)                 /* (RTC_IMR) Time and/or Date Error Mask Mask */
#define RTC_IMR_TDERR(value)                  (RTC_IMR_TDERR_Msk & (_UINT32_(value) << RTC_IMR_TDERR_Pos)) /* Assigment of value for TDERR in the RTC_IMR register */
#define RTC_IMR_Msk                           _UINT32_(0x0000003F)                                 /* (RTC_IMR) Register Mask  */


/* -------- RTC_VER : (RTC Offset: 0x2C) ( R/ 32) Valid Entry Register -------- */
#define RTC_VER_NVTIM_Pos                     _UINT32_(0)                                          /* (RTC_VER) Non-valid Time Position */
#define RTC_VER_NVTIM_Msk                     (_UINT32_(0x1) << RTC_VER_NVTIM_Pos)                 /* (RTC_VER) Non-valid Time Mask */
#define RTC_VER_NVTIM(value)                  (RTC_VER_NVTIM_Msk & (_UINT32_(value) << RTC_VER_NVTIM_Pos)) /* Assigment of value for NVTIM in the RTC_VER register */
#define RTC_VER_NVCAL_Pos                     _UINT32_(1)                                          /* (RTC_VER) Non-valid Calendar Position */
#define RTC_VER_NVCAL_Msk                     (_UINT32_(0x1) << RTC_VER_NVCAL_Pos)                 /* (RTC_VER) Non-valid Calendar Mask */
#define RTC_VER_NVCAL(value)                  (RTC_VER_NVCAL_Msk & (_UINT32_(value) << RTC_VER_NVCAL_Pos)) /* Assigment of value for NVCAL in the RTC_VER register */
#define RTC_VER_NVTIMALR_Pos                  _UINT32_(2)                                          /* (RTC_VER) Non-valid Time Alarm Position */
#define RTC_VER_NVTIMALR_Msk                  (_UINT32_(0x1) << RTC_VER_NVTIMALR_Pos)              /* (RTC_VER) Non-valid Time Alarm Mask */
#define RTC_VER_NVTIMALR(value)               (RTC_VER_NVTIMALR_Msk & (_UINT32_(value) << RTC_VER_NVTIMALR_Pos)) /* Assigment of value for NVTIMALR in the RTC_VER register */
#define RTC_VER_NVCALALR_Pos                  _UINT32_(3)                                          /* (RTC_VER) Non-valid Calendar Alarm Position */
#define RTC_VER_NVCALALR_Msk                  (_UINT32_(0x1) << RTC_VER_NVCALALR_Pos)              /* (RTC_VER) Non-valid Calendar Alarm Mask */
#define RTC_VER_NVCALALR(value)               (RTC_VER_NVCALALR_Msk & (_UINT32_(value) << RTC_VER_NVCALALR_Pos)) /* Assigment of value for NVCALALR in the RTC_VER register */
#define RTC_VER_Msk                           _UINT32_(0x0000000F)                                 /* (RTC_VER) Register Mask  */


/* -------- RTC_TCR : (RTC Offset: 0x34) (R/W 32) Tamper Control Register -------- */
#define RTC_TCR_TAMPEN0_Pos                   _UINT32_(0)                                          /* (RTC_TCR) Timestamping on TMPx input is enabled Position */
#define RTC_TCR_TAMPEN0_Msk                   (_UINT32_(0x1) << RTC_TCR_TAMPEN0_Pos)               /* (RTC_TCR) Timestamping on TMPx input is enabled Mask */
#define RTC_TCR_TAMPEN0(value)                (RTC_TCR_TAMPEN0_Msk & (_UINT32_(value) << RTC_TCR_TAMPEN0_Pos)) /* Assigment of value for TAMPEN0 in the RTC_TCR register */
#define   RTC_TCR_TAMPEN0_TIMESTAMP_OFF_Val   _UINT32_(0x0)                                        /* (RTC_TCR) Tamper event on TMPx input is not timestamped.  */
#define   RTC_TCR_TAMPEN0_TIMESTAMP_ON_Val    _UINT32_(0x1)                                        /* (RTC_TCR) Tamper event on TMPx input is timestamped.  */
#define RTC_TCR_TAMPEN0_TIMESTAMP_OFF         (RTC_TCR_TAMPEN0_TIMESTAMP_OFF_Val << RTC_TCR_TAMPEN0_Pos) /* (RTC_TCR) Tamper event on TMPx input is not timestamped. Position  */
#define RTC_TCR_TAMPEN0_TIMESTAMP_ON          (RTC_TCR_TAMPEN0_TIMESTAMP_ON_Val << RTC_TCR_TAMPEN0_Pos) /* (RTC_TCR) Tamper event on TMPx input is timestamped. Position  */
#define RTC_TCR_TAMPEN1_Pos                   _UINT32_(1)                                          /* (RTC_TCR) Timestamping on TMPx input is enabled Position */
#define RTC_TCR_TAMPEN1_Msk                   (_UINT32_(0x1) << RTC_TCR_TAMPEN1_Pos)               /* (RTC_TCR) Timestamping on TMPx input is enabled Mask */
#define RTC_TCR_TAMPEN1(value)                (RTC_TCR_TAMPEN1_Msk & (_UINT32_(value) << RTC_TCR_TAMPEN1_Pos)) /* Assigment of value for TAMPEN1 in the RTC_TCR register */
#define   RTC_TCR_TAMPEN1_TIMESTAMP_OFF_Val   _UINT32_(0x0)                                        /* (RTC_TCR) Tamper event on TMPx input is not timestamped.  */
#define   RTC_TCR_TAMPEN1_TIMESTAMP_ON_Val    _UINT32_(0x1)                                        /* (RTC_TCR) Tamper event on TMPx input is timestamped.  */
#define RTC_TCR_TAMPEN1_TIMESTAMP_OFF         (RTC_TCR_TAMPEN1_TIMESTAMP_OFF_Val << RTC_TCR_TAMPEN1_Pos) /* (RTC_TCR) Tamper event on TMPx input is not timestamped. Position  */
#define RTC_TCR_TAMPEN1_TIMESTAMP_ON          (RTC_TCR_TAMPEN1_TIMESTAMP_ON_Val << RTC_TCR_TAMPEN1_Pos) /* (RTC_TCR) Tamper event on TMPx input is timestamped. Position  */
#define RTC_TCR_TAMPEN2_Pos                   _UINT32_(2)                                          /* (RTC_TCR) Timestamping on TMPx input is enabled Position */
#define RTC_TCR_TAMPEN2_Msk                   (_UINT32_(0x1) << RTC_TCR_TAMPEN2_Pos)               /* (RTC_TCR) Timestamping on TMPx input is enabled Mask */
#define RTC_TCR_TAMPEN2(value)                (RTC_TCR_TAMPEN2_Msk & (_UINT32_(value) << RTC_TCR_TAMPEN2_Pos)) /* Assigment of value for TAMPEN2 in the RTC_TCR register */
#define   RTC_TCR_TAMPEN2_TIMESTAMP_OFF_Val   _UINT32_(0x0)                                        /* (RTC_TCR) Tamper event on TMPx input is not timestamped.  */
#define   RTC_TCR_TAMPEN2_TIMESTAMP_ON_Val    _UINT32_(0x1)                                        /* (RTC_TCR) Tamper event on TMPx input is timestamped.  */
#define RTC_TCR_TAMPEN2_TIMESTAMP_OFF         (RTC_TCR_TAMPEN2_TIMESTAMP_OFF_Val << RTC_TCR_TAMPEN2_Pos) /* (RTC_TCR) Tamper event on TMPx input is not timestamped. Position  */
#define RTC_TCR_TAMPEN2_TIMESTAMP_ON          (RTC_TCR_TAMPEN2_TIMESTAMP_ON_Val << RTC_TCR_TAMPEN2_Pos) /* (RTC_TCR) Tamper event on TMPx input is timestamped. Position  */
#define RTC_TCR_TAMPEN3_Pos                   _UINT32_(3)                                          /* (RTC_TCR) Timestamping on TMPx input is enabled Position */
#define RTC_TCR_TAMPEN3_Msk                   (_UINT32_(0x1) << RTC_TCR_TAMPEN3_Pos)               /* (RTC_TCR) Timestamping on TMPx input is enabled Mask */
#define RTC_TCR_TAMPEN3(value)                (RTC_TCR_TAMPEN3_Msk & (_UINT32_(value) << RTC_TCR_TAMPEN3_Pos)) /* Assigment of value for TAMPEN3 in the RTC_TCR register */
#define   RTC_TCR_TAMPEN3_TIMESTAMP_OFF_Val   _UINT32_(0x0)                                        /* (RTC_TCR) Tamper event on TMPx input is not timestamped.  */
#define   RTC_TCR_TAMPEN3_TIMESTAMP_ON_Val    _UINT32_(0x1)                                        /* (RTC_TCR) Tamper event on TMPx input is timestamped.  */
#define RTC_TCR_TAMPEN3_TIMESTAMP_OFF         (RTC_TCR_TAMPEN3_TIMESTAMP_OFF_Val << RTC_TCR_TAMPEN3_Pos) /* (RTC_TCR) Tamper event on TMPx input is not timestamped. Position  */
#define RTC_TCR_TAMPEN3_TIMESTAMP_ON          (RTC_TCR_TAMPEN3_TIMESTAMP_ON_Val << RTC_TCR_TAMPEN3_Pos) /* (RTC_TCR) Tamper event on TMPx input is timestamped. Position  */
#define RTC_TCR_TAMPEN4_Pos                   _UINT32_(4)                                          /* (RTC_TCR) Timestamping on TMPx input is enabled Position */
#define RTC_TCR_TAMPEN4_Msk                   (_UINT32_(0x1) << RTC_TCR_TAMPEN4_Pos)               /* (RTC_TCR) Timestamping on TMPx input is enabled Mask */
#define RTC_TCR_TAMPEN4(value)                (RTC_TCR_TAMPEN4_Msk & (_UINT32_(value) << RTC_TCR_TAMPEN4_Pos)) /* Assigment of value for TAMPEN4 in the RTC_TCR register */
#define   RTC_TCR_TAMPEN4_TIMESTAMP_OFF_Val   _UINT32_(0x0)                                        /* (RTC_TCR) Tamper event on TMPx input is not timestamped.  */
#define   RTC_TCR_TAMPEN4_TIMESTAMP_ON_Val    _UINT32_(0x1)                                        /* (RTC_TCR) Tamper event on TMPx input is timestamped.  */
#define RTC_TCR_TAMPEN4_TIMESTAMP_OFF         (RTC_TCR_TAMPEN4_TIMESTAMP_OFF_Val << RTC_TCR_TAMPEN4_Pos) /* (RTC_TCR) Tamper event on TMPx input is not timestamped. Position  */
#define RTC_TCR_TAMPEN4_TIMESTAMP_ON          (RTC_TCR_TAMPEN4_TIMESTAMP_ON_Val << RTC_TCR_TAMPEN4_Pos) /* (RTC_TCR) Tamper event on TMPx input is timestamped. Position  */
#define RTC_TCR_TAMPCLR_Pos                   _UINT32_(16)                                         /* (RTC_TCR) Tamper Clear Position */
#define RTC_TCR_TAMPCLR_Msk                   (_UINT32_(0x1) << RTC_TCR_TAMPCLR_Pos)               /* (RTC_TCR) Tamper Clear Mask */
#define RTC_TCR_TAMPCLR(value)                (RTC_TCR_TAMPCLR_Msk & (_UINT32_(value) << RTC_TCR_TAMPCLR_Pos)) /* Assigment of value for TAMPCLR in the RTC_TCR register */
#define   RTC_TCR_TAMPCLR_NOT_ENABLE_Val      _UINT32_(0x0)                                        /* (RTC_TCR) A Tamper event does not create an immediate clear on GPBR registers.  */
#define   RTC_TCR_TAMPCLR_ENABLE_Val          _UINT32_(0x1)                                        /* (RTC_TCR) Tamper event on TMP0 or TMP4 generates an immediate clear on GPBR registers. The number of cleared GPBR registers depends on the value of FGPBRCLR.  */
#define RTC_TCR_TAMPCLR_NOT_ENABLE            (RTC_TCR_TAMPCLR_NOT_ENABLE_Val << RTC_TCR_TAMPCLR_Pos) /* (RTC_TCR) A Tamper event does not create an immediate clear on GPBR registers. Position  */
#define RTC_TCR_TAMPCLR_ENABLE                (RTC_TCR_TAMPCLR_ENABLE_Val << RTC_TCR_TAMPCLR_Pos)  /* (RTC_TCR) Tamper event on TMP0 or TMP4 generates an immediate clear on GPBR registers. The number of cleared GPBR registers depends on the value of FGPBRCLR. Position  */
#define RTC_TCR_FGPBRCLR_Pos                  _UINT32_(17)                                         /* (RTC_TCR) Full GPBR Clear Position */
#define RTC_TCR_FGPBRCLR_Msk                  (_UINT32_(0x1) << RTC_TCR_FGPBRCLR_Pos)              /* (RTC_TCR) Full GPBR Clear Mask */
#define RTC_TCR_FGPBRCLR(value)               (RTC_TCR_FGPBRCLR_Msk & (_UINT32_(value) << RTC_TCR_FGPBRCLR_Pos)) /* Assigment of value for FGPBRCLR in the RTC_TCR register */
#define   RTC_TCR_FGPBRCLR_HALF_Val           _UINT32_(0x0)                                        /* (RTC_TCR) If TAMPCLR is set to '1', a tamper event immediately clears GPBR0 to GPBR11.  */
#define   RTC_TCR_FGPBRCLR_FULL_Val           _UINT32_(0x1)                                        /* (RTC_TCR) If TAMPCLR is set to '1', a tamper event immediately clears all GPBRs.  */
#define RTC_TCR_FGPBRCLR_HALF                 (RTC_TCR_FGPBRCLR_HALF_Val << RTC_TCR_FGPBRCLR_Pos)  /* (RTC_TCR) If TAMPCLR is set to '1', a tamper event immediately clears GPBR0 to GPBR11. Position  */
#define RTC_TCR_FGPBRCLR_FULL                 (RTC_TCR_FGPBRCLR_FULL_Val << RTC_TCR_FGPBRCLR_Pos)  /* (RTC_TCR) If TAMPCLR is set to '1', a tamper event immediately clears all GPBRs. Position  */
#define RTC_TCR_Msk                           _UINT32_(0x0003001F)                                 /* (RTC_TCR) Register Mask  */

#define RTC_TCR_TAMPEN_Pos                    _UINT32_(0)                                          /* (RTC_TCR Position) Timestamping on TMPx input is enabled */
#define RTC_TCR_TAMPEN_Msk                    (_UINT32_(0x1F) << RTC_TCR_TAMPEN_Pos)               /* (RTC_TCR Mask) TAMPEN */
#define RTC_TCR_TAMPEN(value)                 (RTC_TCR_TAMPEN_Msk & (_UINT32_(value) << RTC_TCR_TAMPEN_Pos)) 

/* -------- RTC_TISR : (RTC Offset: 0x38) ( R/ 32) Tamper Input Status Register -------- */
#define RTC_TISR_TISR0_Pos                    _UINT32_(0)                                          /* (RTC_TISR) TMPx Input Status Register Position */
#define RTC_TISR_TISR0_Msk                    (_UINT32_(0x1) << RTC_TISR_TISR0_Pos)                /* (RTC_TISR) TMPx Input Status Register Mask */
#define RTC_TISR_TISR0(value)                 (RTC_TISR_TISR0_Msk & (_UINT32_(value) << RTC_TISR_TISR0_Pos)) /* Assigment of value for TISR0 in the RTC_TISR register */
#define RTC_TISR_TISR1_Pos                    _UINT32_(1)                                          /* (RTC_TISR) TMPx Input Status Register Position */
#define RTC_TISR_TISR1_Msk                    (_UINT32_(0x1) << RTC_TISR_TISR1_Pos)                /* (RTC_TISR) TMPx Input Status Register Mask */
#define RTC_TISR_TISR1(value)                 (RTC_TISR_TISR1_Msk & (_UINT32_(value) << RTC_TISR_TISR1_Pos)) /* Assigment of value for TISR1 in the RTC_TISR register */
#define RTC_TISR_TISR2_Pos                    _UINT32_(2)                                          /* (RTC_TISR) TMPx Input Status Register Position */
#define RTC_TISR_TISR2_Msk                    (_UINT32_(0x1) << RTC_TISR_TISR2_Pos)                /* (RTC_TISR) TMPx Input Status Register Mask */
#define RTC_TISR_TISR2(value)                 (RTC_TISR_TISR2_Msk & (_UINT32_(value) << RTC_TISR_TISR2_Pos)) /* Assigment of value for TISR2 in the RTC_TISR register */
#define RTC_TISR_TISR3_Pos                    _UINT32_(3)                                          /* (RTC_TISR) TMPx Input Status Register Position */
#define RTC_TISR_TISR3_Msk                    (_UINT32_(0x1) << RTC_TISR_TISR3_Pos)                /* (RTC_TISR) TMPx Input Status Register Mask */
#define RTC_TISR_TISR3(value)                 (RTC_TISR_TISR3_Msk & (_UINT32_(value) << RTC_TISR_TISR3_Pos)) /* Assigment of value for TISR3 in the RTC_TISR register */
#define RTC_TISR_TISR4_Pos                    _UINT32_(4)                                          /* (RTC_TISR) TMPx Input Status Register Position */
#define RTC_TISR_TISR4_Msk                    (_UINT32_(0x1) << RTC_TISR_TISR4_Pos)                /* (RTC_TISR) TMPx Input Status Register Mask */
#define RTC_TISR_TISR4(value)                 (RTC_TISR_TISR4_Msk & (_UINT32_(value) << RTC_TISR_TISR4_Pos)) /* Assigment of value for TISR4 in the RTC_TISR register */
#define RTC_TISR_Msk                          _UINT32_(0x0000001F)                                 /* (RTC_TISR) Register Mask  */

#define RTC_TISR_TISR_Pos                     _UINT32_(0)                                          /* (RTC_TISR Position) TMPx Input Status Register */
#define RTC_TISR_TISR_Msk                     (_UINT32_(0x1F) << RTC_TISR_TISR_Pos)                /* (RTC_TISR Mask) TISR */
#define RTC_TISR_TISR(value)                  (RTC_TISR_TISR_Msk & (_UINT32_(value) << RTC_TISR_TISR_Pos)) 

/** \brief RTC register offsets definitions */
#define RTC_FSTR_REG_OFST              _UINT32_(0x00)      /* (RTC_FSTR) First Stamping Time Register of Source 0 Offset */
#define RTC_FSDR_REG_OFST              _UINT32_(0x04)      /* (RTC_FSDR) First Stamping Date Register of Source 0 Offset */
#define RTC_LSTR_REG_OFST              _UINT32_(0x08)      /* (RTC_LSTR) Last Stamping Time Register of Source 0 Offset */
#define RTC_LSDR_REG_OFST              _UINT32_(0x0C)      /* (RTC_LSDR) Last Stamping Date Register of Source 0 Offset */
#define RTC_CR_REG_OFST                _UINT32_(0x00)      /* (RTC_CR) Control Register Offset */
#define RTC_MR_REG_OFST                _UINT32_(0x04)      /* (RTC_MR) Mode Register Offset */
#define RTC_TIMR_REG_OFST              _UINT32_(0x08)      /* (RTC_TIMR) Time Register Offset */
#define RTC_CALR_REG_OFST              _UINT32_(0x0C)      /* (RTC_CALR) Calendar Register Offset */
#define RTC_TIMALR_REG_OFST            _UINT32_(0x10)      /* (RTC_TIMALR) Time Alarm Register Offset */
#define RTC_CALALR_REG_OFST            _UINT32_(0x14)      /* (RTC_CALALR) Calendar Alarm Register Offset */
#define RTC_SR_REG_OFST                _UINT32_(0x18)      /* (RTC_SR) Status Register Offset */
#define RTC_SCCR_REG_OFST              _UINT32_(0x1C)      /* (RTC_SCCR) Status Clear Command Register Offset */
#define RTC_IER_REG_OFST               _UINT32_(0x20)      /* (RTC_IER) Interrupt Enable Register Offset */
#define RTC_IDR_REG_OFST               _UINT32_(0x24)      /* (RTC_IDR) Interrupt Disable Register Offset */
#define RTC_IMR_REG_OFST               _UINT32_(0x28)      /* (RTC_IMR) Interrupt Mask Register Offset */
#define RTC_VER_REG_OFST               _UINT32_(0x2C)      /* (RTC_VER) Valid Entry Register Offset */
#define RTC_TCR_REG_OFST               _UINT32_(0x34)      /* (RTC_TCR) Tamper Control Register Offset */
#define RTC_TISR_REG_OFST              _UINT32_(0x38)      /* (RTC_TISR) Tamper Input Status Register Offset */

